//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit2.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm2 *Form2;
//---------------------------------------------------------------------------
__fastcall TForm2::TForm2(TComponent* Owner)
	: TForm(Owner)
{

}
//---------------------------------------------------------------------------
//кнопка окей, которая закрывает окно
void __fastcall TForm2::Button1Click(TObject *Sender)
{
Close();
}
//при создании окна применения цвета к форме2
void __fastcall TForm2::FormCreate(TObject *Sender)
{
Form2->Color = RGB(239, 228, 176);
}
//---------------------------------------------------------------------------

